app/views/posts/_form.html.erb

SELECT "tags".* FROM "tags"
---

  <%= f.collection_check_boxes :tag_ids, Tag.all, :id, :name %>