app/controllers/posts_controller.rb

INSERT INTO "posts" ("name", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Post title"], ["content", "post content"], ["created_at", "2015-09-10 01:32:26.162354"], ["updated_at", "2015-09-10 01:32:26.162354"]]
---
  def create
    @post = Post.new(post_params)

    respond_to do |format|
      if @post.save